{"version":"0.4","title":"GCTC-MECH","type":"page","content":[{"id":"1febb85f","settings":{"layout":"full_width"},"elements":[{"id":"57ba8c72","settings":{"_column_size":100,"_inline_size":null,"background_background":"classic","background_color":"#000000"},"elements":[{"id":"2bd836d7","settings":{"html":"<br\/><br\/><br\/><br\/>","_background_background":"classic","_background_color":"#000000"},"elements":[],"isInner":false,"widgetType":"html","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"673288e5","settings":[],"elements":[{"id":"486b608e","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"6835432b","settings":{"title":"Mechanical Engineering\n","size":"xl","align":"center","typography_typography":"custom","typography_font_family":"Verdana","typography_text_transform":"uppercase"},"elements":[],"isInner":false,"widgetType":"heading","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"16f8de06","settings":[],"elements":[{"id":"cd24de2","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"2499a04d","settings":{"editor":"<p align=\"justify\">The department of Mechanical Engineering was established in the year 2011 with an intake of 60 students. Currently the department offers an under graduate program B.Tech in Mechanical Engineering with an annual intake of 120 students. The department is headed by Dr. S. Shyam Kumar. He has 29 years of teaching experience in various reputed institutions. There are 5 Professors, 4 Associate Professor and 20 Assistant Professor in the department.<\/p>"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"76e1b89d","settings":[],"elements":[{"id":"3bb6606e","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"60bff671","settings":{"title":"Vision and Mission\n"},"elements":[],"isInner":false,"widgetType":"heading","elType":"widget"},{"id":"1b375320","settings":{"structure":"20"},"elements":[{"id":"16e8d1ff","settings":{"_column_size":50,"_inline_size":null},"elements":[{"id":"2e61d7e2","settings":{"title":"Vision of the Department","size":"medium"},"elements":[],"isInner":false,"widgetType":"heading","elType":"widget"},{"id":"7fa3e4b4","settings":{"editor":"<p>The Mechanical Engineering department strives to be recognized globally for outstanding education and research, imparting quality education,churning well-qualified engineers, who are creative, innovative, and entrepreneurial, solving problems for societal development.<\/p><p> <\/p>"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":true,"elType":"column"},{"id":"a236bf4","settings":{"_column_size":50,"_inline_size":null},"elements":[{"id":"3ca4fe41","settings":{"title":"Mission of the Department","size":"medium"},"elements":[],"isInner":false,"widgetType":"heading","elType":"widget"},{"id":"1ee4d1e1","settings":{"editor":"<section id=\"vision-mission\"><ol><li>Imparting quality education to students to enhance their skills and make them globally competitive.<\/li><li>Prepare graduates to engage in life-long learning, possess intellectual capabilities, serving society with a strong commitment to their profession, meeting technical challenges and exhibiting ethical responsibility for societal development.<\/li><li>Conduct quality research, create opportunities for students and faculty to showcase their talent, disseminate knowledge, and promote community development, leading to peace and harmony in society.<\/li><\/ol><\/section>"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":true,"elType":"column"}],"isInner":true,"elType":"section"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"},{"id":"5c8ed0aa","settings":[],"elements":[{"id":"1f758a4d","settings":{"_column_size":100,"_inline_size":null},"elements":[{"id":"4f4d3da0","settings":{"title":"Laboratory Details\n"},"elements":[],"isInner":false,"widgetType":"heading","elType":"widget"},{"id":"77a16d08","settings":{"editor":"<p>The department of Mechanical Engineering is equipped with the following state of the art laboratories<\/p><ul class=\"arrow-style\"><li><strong>Engineering Workshop<\/strong><br \/>This lab consists of various sections consisting of fitting, carpentry, house wiring, tin smithy, black smithy and plumbing to familiarize students about the tools used in various manufacturing processes and giving them various assignments that enable them to acquire skill to use the various tools.<\/li><li><strong>Production Technology-I Lab<\/strong><br \/>The lab is well equipped with the state of the art equipments to provide an hands on experience to the students in various production technology processes such as casting, welding, forming and forging etc.<\/li><li><strong>Metallurgy Lab<\/strong><br \/>The lab is fully equipped with the required infrastructure and equipments is to determine the microstructure of both ferrous and non-ferrous materials and also to perform various heat treatment processes. It also has facilities for developing new materials, capturing microstructure and determining mechanical and wear characteristics for various materials.<\/li><li><strong>Mechanics of Solids Lab<\/strong><br \/>The lab is equipped with state of the art equipments to demonstrate the basic principles in the areas of Strength &amp; Mechanics of Materials and Structural Analysis and to carryout experiments to measure the mechanical properties of the materials such as Tensile strength &amp; Compressive strength, Young’s Modulus, Rigidity Modulus, Impact Strength, Hardness, etc.<\/li><li><strong>Thermal Engineering Lab<\/strong><br \/>The lab is equipped with state of the art experimental setups of internal combustion engines, air compressor and also the working models of Boilers used in the thermal power plants. Students will be given training to understand the basic working principles of engines and also to carryout experiments to measure various performance parameters such as Brake power, Efficiency, Torque, mass of fuel etc., to understand the design of an IC engine.<\/li><li><strong>Production Technology-II Lab<\/strong><br \/>This laboratory is well equipped with various machines tools that are used in industry to provide an introduction to the Know-how of common processes used in industries for manufacturing parts by removal of material in a controlled manner and to impart hands on experience on lathe, drilling, shaping, milling, slotting, grinding and tool and cutter grinding machines.<\/li><li><strong>Metrology Lab<\/strong><br \/>This lab is equipped with various instruments that are used to measure physical attributes of machine components like circularity, angularity, parallelism etc.<\/li><li><strong>Heat Transfer lab<\/strong><br \/>The lab is well equipped with state of the art experimental apparatus is to understand the concepts of conduction, convection and radiation practically in various thermal systems a series of experiments.<\/li><li><strong>Instumentation Lab<\/strong><br \/>The lab consists of various instruments that are used in measuring the fundamental properties such as pressure, temperature and also to demonstrate the calibration procedures of various instruments like rotameter, pressure gauge etc.<\/li><li><strong>CAD Lab<\/strong><br \/>The lab is equipped with various design software’s to provide the basic knowledge of Computer Aided Drafting (CAD) Techniques to the students in order to train them to draw various machine components and thus enable them to design various two and three dimensional mechanical components. The course presents the elements of solid modeling, creation of parts and the assembly of parts to form a final design using Software’s<\/li><li><strong>CAM Lab<\/strong><br \/>The lab is equipped with CNC Machines to manufacture the components that are modeled and designed using design software’s.<\/li><li><strong>Digital Fabrication Lab<\/strong><br \/>The lab is equipped with rapid prototype machine to give training on digital fabrication software. to enable the students to convert their innovative ideas into fabricated physical models.<\/li><li><strong>Design for Manufacturing Lab<\/strong><br \/>This lab enables the students to design objects for additive manufacturing and then carryout various parametric studies.<\/li><li><strong>Kinematics of Machinery Lab<\/strong><br \/>Kinematics of machinery lab imparts practical knowledge on design and analysis of mechanisms for the specified type of motion in a machines.<\/li><li><strong>Engineering Drawing With AutoCAD lab<\/strong><br \/>This lab enables the students to acquire knowledge to locate and apply features of AutoCAD that automate the drafting process, facilitate creation of more accurate drawings with minimum time and capable of making 2d and 3d drawings.<\/li><li><strong>Mechanics of Fluid and Hydraulic Machinery Lab<\/strong><br \/>This lab enables the students to acquire knowledge of Francis turbine test rig, Kaplan turbine test rig, Pelton wheel test rig, Impact of jet on vane test rig, Friction in pipes test rig, Single stage centrifugal pump test rig, Multi stage centrifugal pump test rig, Venturimeter, and Orifice meter.<\/li><\/ul>"},"elements":[],"isInner":false,"widgetType":"text-editor","elType":"widget"}],"isInner":false,"elType":"column"}],"isInner":false,"elType":"section"}],"page_settings":{"hide_title":"yes"}}